In [25]:
#pandas library
import pandas as pd

In [29]:
#data series create. use capita S for series
ser=pd.Series(['a', 'b', 'c', 'd', 'e'], [1, 2, 3, 4, 5])

In [31]:
print (ser)

1    a
2    b
3    c
4    d
5    e
dtype: object

In [33]:
ser.index

Index([1, 2, 3, 4, 5], dtype='int64')

In [39]:
ser.loc[[4,5]]

4    d
5    e
dtype: object

In [43]:
ser[[1,4,5]]

1    a
4    d
5    e
dtype: object

In [45]:
ser.iloc[3]

'd'

In [47]:
ser [[1]]*20

1    aaaaaaaaaaaaaaaaaaaa
dtype: object

## Dataframe

In [66]:
a = {'one':pd.Series([10,20,30,40,50]),
     'two':pd.Series([-10, -20, -30, -40, -50]) 
    }

In [68]:
df = pd.DataFrame(a)

In [72]:
print(df)

   one  two
0   10  -10
1   20  -20
2   30  -30
3   40  -40
4   50  -50

In [74]:
a = {'one':pd.Series([10,20,30,40,50], index = ['a','b','c','d','e']),
     'two':pd.Series([-10, -20, -30, -40, -50], index = ['a','b','c','d','e']) 
    }

In [76]:
df=pd.DataFrame(a)

In [78]:
print(df)

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40  -40
e   50  -50

In [80]:
df

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40  -40
e   50  -50

In [82]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [84]:
df.loc[['b']]

   one  two
b   20  -20

In [86]:
df.iloc[0]

one    10
two   -10
Name: a, dtype: int64

In [88]:
df.iloc[3]

one    40
two   -40
Name: d, dtype: int64

In [98]:
#for not available
a = {'one':pd.Series([10,20,30,40,50], index = ['a','b','c','d','e']),
     'two':pd.Series([-10, -20, -30, -40, -50], index = ['na','nb','nc','nd','ne']) 
    }

In [96]:
pd.DataFrame(a)

     one   two
a   10.0   NaN
b   20.0   NaN
c   30.0   NaN
d   40.0   NaN
e   50.0   NaN
na   NaN -10.0
nb   NaN -20.0
nc   NaN -30.0
nd   NaN -40.0
ne   NaN -50.0

In [104]:
a = {'English':pd.Series([40, 35, 90, 86,55], index = ['RP','Suyog','Hari','Shyam','Indira']),
     'Math':pd.Series([10, 44, 70, 60, 78], index = ['RP','Suyog','Hari','Shyam','Indira']), 
     'Science':pd.Series([20, 5, 0, 90, 80], index = ['RP','Suyog','Hari','Shyam','Indira']), 
    }

In [106]:
df=pd.DataFrame(a)

In [108]:
df

        English  Math  Science
RP           40    10       20
Suyog        35    44        5
Hari         90    70        0
Shyam        86    60       90
Indira       55    78       80

In [114]:
df.loc[['Indira']]

        English  Math  Science
Indira       55    78       80

In [136]:
R = {'English':([40, 35, 90, 86,55]), 
     'Math':([10, 44, 70, 60, 78]), 
     'Science':([20, 5, 0, 90, 80]) 
    }

In [142]:
ad=pd.Series(R,index=['avi','bishal','chan','dro','ellle'],columns=['english','math','science'])

TypeError: Series.__init__() got an unexpected keyword argument 'columns'

In [140]:
print(ad)

       english math science
avi        NaN  NaN     NaN
bishal     NaN  NaN     NaN
chan       NaN  NaN     NaN
dro        NaN  NaN     NaN
ellle      NaN  NaN     NaN